package lr1;
//Напишите программу для вычисления суммы двух чисел. Оба числа вводятся пользователем. Для вычисления суммы используйте оператор +.
public class Example13 {
    public static void main(String[] args) {

Scanner in = new Scanner(System.in);

System.out.println("Введите первое число: ");

int a = in.nextInt();

System.out.println("Введите второе число: ");

int b = in.nextInt();

System.out.println("Сумма= " + (a+b);

in.close();

    }
}
