package lr1;
//Напишите программу, в которой по возрасту определяется год рождения.
public class Example12 {
    public static void main(String[] args) {

Scanner in = new Scanner(System.in);

System.out.println("Введите Ваш возраст: ");

int age = in.nextInt();

System.out.println("Ваш год рождения: " + (age);

in.close;

    }
}
