package timus.task_1197;
// JUDGE_ID 368360HH

/*
1197. Один в поле воин
Ограничение времени: 1.0 секунды
Ограничение памяти: 64 МБ
Условие этой задачи очень простое: вам всего лишь надо определить, сколько клеток находится
под боем шахматного коня, одиноко стоящего на шахматной доске. На всякий случай напомним, что
конь ходит буквой «Г» — на две клетки по горизонтали или вертикали в любом направлении, и потом
на одну клетку в направлении, перпендикулярном первоначальному.
Исходные данные
В первой строке находится единственное число N, 1 ≤ N ≤ 64 — количество тестов. В каждой из
последующих N строк содержится очередной тест: два символа (маленькая латинская буква от 'a' до 'h' и
цифра от 1 до 8) — стандартное шахматное обозначение клетки, на которой стоит конь. При этом буква
обозначает вертикаль, а цифра — горизонталь.
Результат
Выведите N строк: в каждой из них должно находиться единственное число — количество клеток шахматной
доски, находящихся под боем коня.
Пример
исходные данные	            результат
3
a1
d4
g6
                                2
                                8
                                6
 */
public class Main {
    public static void main(String[] args) {



    }
}
