package lr4;
/*
Напишите программу «Шифр Цезаря», которая зашифровывает введенный текст.
Используете кодовую таблицу символов. При запуске программы в консоль необходимо
вывести сообщение: «Введите текст для шифрования», после ввода текста, появляется
сообщение: «Введите ключ».
После того как введены все данные, необходимо вывести преобразованную строку с сообщением
«Текст после преобразования : ». Далее необходимо задать вопрос пользователю:
«Выполнить обратное преобразование? (y/n)», если пользователь вводит «y»,
тогда выполнить обратное преобразование. Если пользователь вводит «n»,
того программа выводит сообщение «До свидания!». Если пользователь вводит что-то другое,
отличное от «y» или «n», то программа ему выводит сообщение: «Введите корректный ответ».
 */
public class Example8 {
}
